src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКопии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторПостоянный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИнформационныеБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СоздатьЭлементПоУникальномуИдентификатору(УникальныйИдентификатор, НомерПакета, ПостоянныйИдентификатор = "") Экспорт
    
    НовыйЭлемент = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НовыйЭлемент.Наименование = УникальныйИдентификатор;
	НовыйЭлемент.УникальныйИдентификатор = УникальныйИдентификатор;
	НовыйЭлемент.УникальныйИдентификаторПостоянный = ПостоянныйИдентификатор;
	НовыйЭлемент.НомерПакета = Число(НомерПакета);
	НовыйЭлемент.УстановитьСсылкуНового(Справочники.ИнформационныеБазы.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификатор)));
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
    
КонецФункции

Функция ПроверитьКоллизию(Ссылка, НомерПакетаВБазе, НомерПакетаНовый) Экспорт
    
    СпрОбъект = Ссылка.ПолучитьОбъект();
    НомерПакетаЧисло = Число(НомерПакетаНовый);
    Если НомерПакетаЧисло <= НомерПакетаВБазе Тогда
        СпрОбъект.ЕстьКопии = Истина;
    Иначе
        СпрОбъект.НомерПакета = НомерПакетаЧисло;
    КонецЕсли;
    СпрОбъект.Записать();
        
КонецФункции

Процедура УстановитьПостоянныйУникальныйИдентификатор(Ссылка, ПостоянныйИдентификатор) Экспорт
	СпрОбъект = Ссылка.ПолучитьОбъект();
	СпрОбъект.УникальныйИдентификаторПостоянный = ПостоянныйИдентификатор;
	СпрОбъект.Записать();
КонецПроцедуры

#КонецЕсли
